In [1]:
import pandas as pd
data = {
    "Name":['Ram', 'Shyam' , 'Reema', 'Sita','Geeta'],
    "Age":[10,12,30,34,56],
    "Salary":[10000,20000,30000,40000,50000]
}
dataframe= pd.DataFrame(data)

In [2]:
print(dataframe)

    Name  Age  Salary
0    Ram   10   10000
1  Shyam   12   20000
2  Reema   30   30000
3   Sita   34   40000
4  Geeta   56   50000

In [3]:
dataframe["Bonus"] = dataframe['Salary'] * 0.10

In [4]:
print(dataframe)

    Name  Age  Salary   Bonus
0    Ram   10   10000  1000.0
1  Shyam   12   20000  2000.0
2  Reema   30   30000  3000.0
3   Sita   34   40000  4000.0
4  Geeta   56   50000  5000.0

In [6]:
#using insert method having parameters (loc, columnname, values)
dataframe.insert(0, "EmployeeId" , [10,20,30,40,50])
print(dataframe)

   EmployeeId   Name  Age  Salary   Bonus
0          10    Ram   10   10000  1000.0
1          20  Shyam   12   20000  2000.0
2          30  Reema   30   30000  3000.0
3          40   Sita   34   40000  4000.0
4          50  Geeta   56   50000  5000.0

In [8]:
#.loc(rowindex , column name) = new_value
dataframe.loc[0,"Salary"] = 55000
print(dataframe)

   EmployeeId   Name  Age  Salary   Bonus
0          10    Ram   10   55000  1000.0
1          20  Shyam   12   20000  2000.0
2          30  Reema   30   30000  3000.0
3          40   Sita   34   40000  4000.0
4          50  Geeta   56   50000  5000.0

In [10]:
dataframe["Salary"] = dataframe['Salary'] * 1.10

In [11]:
print(dataframe)

   EmployeeId   Name  Age   Salary   Bonus
0          10    Ram   10  60500.0  5500.0
1          20  Shyam   12  22000.0  2000.0
2          30  Reema   30  33000.0  3000.0
3          40   Sita   34  44000.0  4000.0
4          50  Geeta   56  55000.0  5000.0

In [12]:
#drop(columns= "columnname" , inplace= true) made changes in refrence
dataframe.drop(columns = ['EmployeeId'] , inplace = True)

In [13]:
print(dataframe)

    Name  Age   Salary   Bonus
0    Ram   10  60500.0  5500.0
1  Shyam   12  22000.0  2000.0
2  Reema   30  33000.0  3000.0
3   Sita   34  44000.0  4000.0
4  Geeta   56  55000.0  5000.0

In [14]:
#handling missing data by NaN or None by which isnull is a method 
print(dataframe.isnull())

    Name    Age  Salary  Bonus
0  False  False   False  False
1  False  False   False  False
2  False  False   False  False
3  False  False   False  False
4  False  False   False  False

In [15]:
print(dataframe.isnull().sum())

Name      0
Age       0
Salary    0
Bonus     0
dtype: int64

In [17]:
#dropna(axis=0 , inplace=True)
dataframe.dropna(inplace=True)

In [18]:
#fillna(value, inplace=True)
dataframe.fillna(0,inplace=True)

In [19]:
#interpolation interpolate(type= "Linear", axis=0,inplace=True)
data={
    "Time":[1,2,3,4,5],
    "Value" :[10,None, 30,None,50]
}
dn= pd.DataFrame(data)
print(dn)

   Time  Value
0     1   10.0
1     2    NaN
2     3   30.0
3     4    NaN
4     5   50.0

In [21]:
print(dn)
dn['Value'] = dn['Value'].interpolate(method="linear")
print(dn)

   Time  Value
0     1   10.0
1     2   20.0
2     3   30.0
3     4   40.0
4     5   50.0
   Time  Value
0     1   10.0
1     2   20.0
2     3   30.0
3     4   40.0
4     5   50.0

In [23]:
print(dn)
dn['Value'] = dn['Value'].interpolate(method="polynomial" , order=2)
print(dn)

   Time  Value
0     1   10.0
1     2   20.0
2     3   30.0
3     4   40.0
4     5   50.0
   Time  Value
0     1   10.0
1     2   20.0
2     3   30.0
3     4   40.0
4     5   50.0

In [27]:
#Sorting of data 
#in 1 column .sort_values(by="Columnname" , True/False, inplace = True)
data = {
    "Name":['Ram', 'Shyam' , 'Reema', 'Sita','Geeta'],
    "Age":[10,12,30,34,56],
    "Salary":[10000,20000,30000,40000,50000]
}
dnew= pd.DataFrame(data)
print(dnew)

    Name  Age  Salary
0    Ram   10   10000
1  Shyam   12   20000
2  Reema   30   30000
3   Sita   34   40000
4  Geeta   56   50000

In [28]:
dnew.sort_values(by="Age" ,ascending= False, inplace = True)

In [29]:
print(dnew)

    Name  Age  Salary
4  Geeta   56   50000
3   Sita   34   40000
2  Reema   30   30000
1  Shyam   12   20000
0    Ram   10   10000

In [30]:
dnew.sort_values(by=["Age","Salary"] ,ascending= False, inplace = True)

In [31]:
print(dnew)

    Name  Age  Salary
4  Geeta   56   50000
3   Sita   34   40000
2  Reema   30   30000
1  Shyam   12   20000
0    Ram   10   10000

In [32]:
#aggregate functions 
avg_salary = dnew['Salary'].mean()

In [33]:
print(avg_salary)

30000.0

In [34]:
#grouping of data 
print(dnew)

    Name  Age  Salary
4  Geeta   56   50000
3   Sita   34   40000
2  Reema   30   30000
1  Shyam   12   20000
0    Ram   10   10000

In [36]:
dnew.sort_values(by=["Age","Salary"] ,ascending= True, inplace = True)

In [37]:
print(dnew)

    Name  Age  Salary
0    Ram   10   10000
1  Shyam   12   20000
2  Reema   30   30000
3   Sita   34   40000
4  Geeta   56   50000

In [38]:
#grouping of data 
group= dnew.groupby("Age")['Salary'].sum()

In [39]:
print(group)

Age
10    10000
12    20000
30    30000
34    40000
56    50000
Name: Salary, dtype: int64

In [41]:
dnew.loc[0,'Age']=12

In [42]:
print(dnew)
group= dnew.groupby("Age")['Salary'].sum()

    Name  Age  Salary
0    Ram   12   10000
1  Shyam   12   20000
2  Reema   30   30000
3   Sita   34   40000
4  Geeta   56   50000

In [43]:
print(group)

Age
12    30000
30    30000
34    40000
56    50000
Name: Salary, dtype: int64

In [44]:
#multiple columns 
group= dnew.groupby(["Name","Age"])['Salary'].sum()

In [45]:
print(group)

Name   Age
Geeta  56     50000
Ram    12     10000
Reema  30     30000
Shyam  12     20000
Sita   34     40000
Name: Salary, dtype: int64

In [46]:
group= dnew.groupby("Age")['Salary'].mean()
print(group)

Age
12    15000.0
30    30000.0
34    40000.0
56    50000.0
Name: Salary, dtype: float64

In [47]:
group= dnew.groupby("Age")['Salary'].count()
print(group)

Age
12    2
30    1
34    1
56    1
Name: Salary, dtype: int64

In [48]:
group= dnew.groupby("Age")['Salary'].min()
print(group)

Age
12    10000
30    30000
34    40000
56    50000
Name: Salary, dtype: int64

In [49]:
group= dnew.groupby("Age")['Salary'].max()
print(group)

Age
12    20000
30    30000
34    40000
56    50000
Name: Salary, dtype: int64

In [50]:
group= dnew.groupby("Age")['Salary'].std()
print(group)

Age
12    7071.067812
30            NaN
34            NaN
56            NaN
Name: Salary, dtype: float64

In [51]:
#merging dataframe 
data = {
    "Name":['Ram', 'Shyam' , 'Reema', 'Sita','Geeta'],
    "Age":[10,12,30,34,56],
    "Salary":[10000,20000,30000,40000,50000]
}
df1 = pd.DataFrame(data)
print(df1)

    Name  Age  Salary
0    Ram   10   10000
1  Shyam   12   20000
2  Reema   30   30000
3   Sita   34   40000
4  Geeta   56   50000

In [52]:
data = {
    "Name":['Ram', 'Shyam' , 'Utkarsh', 'Sita','Vansh'],
    "Age":[10,12,30,34,56],
    "Salary":[10000,20000,30000,40000,50000]
}
df2 = pd.DataFrame(data)
print(df2)

      Name  Age  Salary
0      Ram   10   10000
1    Shyam   12   20000
2  Utkarsh   30   30000
3     Sita   34   40000
4    Vansh   56   50000

In [53]:
# .merge(df1 , df2 , on= "ColumnNmae" , how= "inner/outer/left/right/full joins")
merged= pd.merge(df1,df2, on ="Name", how="inner")
print(merged)

    Name  Age_x  Salary_x  Age_y  Salary_y
0    Ram     10     10000     10     10000
1  Shyam     12     20000     12     20000
2   Sita     34     40000     34     40000

In [54]:
merged= pd.merge(df1,df2, on ="Name", how="left")
print(merged)

    Name  Age_x  Salary_x  Age_y  Salary_y
0    Ram     10     10000   10.0   10000.0
1  Shyam     12     20000   12.0   20000.0
2  Reema     30     30000    NaN       NaN
3   Sita     34     40000   34.0   40000.0
4  Geeta     56     50000    NaN       NaN

In [55]:
merged= pd.merge(df1,df2, on ="Name", how="right")
print(merged)

      Name  Age_x  Salary_x  Age_y  Salary_y
0      Ram   10.0   10000.0     10     10000
1    Shyam   12.0   20000.0     12     20000
2  Utkarsh    NaN       NaN     30     30000
3     Sita   34.0   40000.0     34     40000
4    Vansh    NaN       NaN     56     50000

In [57]:
merged= pd.merge(df1,df2, on ="Name", how="outer")
print(merged)

      Name  Age_x  Salary_x  Age_y  Salary_y
0    Geeta   56.0   50000.0    NaN       NaN
1      Ram   10.0   10000.0   10.0   10000.0
2    Reema   30.0   30000.0    NaN       NaN
3    Shyam   12.0   20000.0   12.0   20000.0
4     Sita   34.0   40000.0   34.0   40000.0
5  Utkarsh    NaN       NaN   30.0   30000.0
6    Vansh    NaN       NaN   56.0   50000.0

In [59]:
merged= pd.merge(df1,df2, how="cross")
print(merged)

   Name_x  Age_x  Salary_x   Name_y  Age_y  Salary_y
0     Ram     10     10000      Ram     10     10000
1     Ram     10     10000    Shyam     12     20000
2     Ram     10     10000  Utkarsh     30     30000
3     Ram     10     10000     Sita     34     40000
4     Ram     10     10000    Vansh     56     50000
5   Shyam     12     20000      Ram     10     10000
6   Shyam     12     20000    Shyam     12     20000
7   Shyam     12     20000  Utkarsh     30     30000
8   Shyam     12     20000     Sita     34     40000
9   Shyam     12     20000    Vansh     56     50000
10  Reema     30     30000      Ram     10     10000
11  Reema     30     30000    Shyam     12     20000
12  Reema     30     30000  Utkarsh     30     30000
13  Reema     30     30000     Sita     34     40000
14  Reema     30     30000    Vansh     56     50000
15   Sita     34     40000      Ram     10     10000
16   Sita     34     40000    Shyam     12     20000
17   Sita     34     40000  Utkarsh     30     30000
18   Sita     34     40000     Sita     34     40000
19   Sita     34     40000    Vansh     56     50000
20  Geeta     56     50000      Ram     10     10000
21  Geeta     56     50000    Shyam     12     20000
22  Geeta     56     50000  Utkarsh     30     30000
23  Geeta     56     50000     Sita     34     40000
24  Geeta     56     50000    Vansh     56     50000

In [60]:
pip install -U notebook-as-pdf

Note: you may need to restart the kernel to use updated packages.Collecting notebook-as-pdf
  Downloading notebook_as_pdf-0.5.0-py3-none-any.whl.metadata (2.4 kB)
Requirement already satisfied: nbconvert in c:\users\utkar\anaconda3\lib\site-packages (from notebook-as-pdf) (7.16.4)
Collecting pyppeteer (from notebook-as-pdf)
  Downloading pyppeteer-2.0.0-py3-none-any.whl.metadata (7.1 kB)
Collecting PyPDF2 (from notebook-as-pdf)
  Downloading pypdf2-3.0.1-py3-none-any.whl.metadata (6.8 kB)
Requirement already satisfied: beautifulsoup4 in c:\users\utkar\anaconda3\lib\site-packages (from nbconvert->notebook-as-pdf) (4.12.3)
Requirement already satisfied: bleach!=5.0.0 in c:\users\utkar\anaconda3\lib\site-packages (from nbconvert->notebook-as-pdf) (4.1.0)
Requirement already satisfied: defusedxml in c:\users\utkar\anaconda3\lib\site-packages (from nbconvert->notebook-as-pdf) (0.7.1)
Requirement already satisfied: jinja2>=3.0 in c:\users\utkar\anaconda3\lib\site-packages (from nbconvert->notebook-as-pdf) (3.1.4)
Requirement already satisfied: jupyter-core>=4.7 in c:\users\utkar\anaconda3\lib\site-packages (from nbconvert->notebook-as-pdf) (5.7.2)
Requirement already satisfied: jupyterlab-pygments in c:\users\utkar\anaconda3\lib\site-packages (from nbconvert->notebook-as-pdf) (0.1.2)
Requirement already satisfied: markupsafe>=2.0 in c:\users\utkar\anaconda3\lib\site-packages (from nbconvert->notebook-as-pdf) (2.1.3)
Requirement already satisfied: mistune<4,>=2.0.3 in c:\users\utkar\anaconda3\lib\site-packages (from nbconvert->notebook-as-pdf) (2.0.4)
Requirement already satisfied: nbclient>=0.5.0 in c:\users\utkar\anaconda3\lib\site-packages (from nbconvert->notebook-as-pdf) (0.8.0)
Requirement already satisfied: nbformat>=5.7 in c:\users\utkar\anaconda3\lib\site-packages (from nbconvert->notebook-as-pdf) (5.10.4)
Requirement already satisfied: packaging in c:\users\utkar\anaconda3\lib\site-packages (from nbconvert->notebook-as-pdf) (24.1)
Requirement already satisfied: pandocfilters>=1.4.1 in c:\users\utkar\anaconda3\lib\site-packages (from nbconvert->notebook-as-pdf) (1.5.0)
Requirement already satisfied: pygments>=2.4.1 in c:\users\utkar\anaconda3\lib\site-packages (from nbconvert->notebook-as-pdf) (2.15.1)
Requirement already satisfied: tinycss2 in c:\users\utkar\anaconda3\lib\site-packages (from nbconvert->notebook-as-pdf) (1.2.1)
Requirement already satisfied: traitlets>=5.1 in c:\users\utkar\anaconda3\lib\site-packages (from nbconvert->notebook-as-pdf) (5.14.3)
Requirement already satisfied: appdirs<2.0.0,>=1.4.3 in c:\users\utkar\anaconda3\lib\site-packages (from pyppeteer->notebook-as-pdf) (1.4.4)
Requirement already satisfied: certifi>=2023 in c:\users\utkar\anaconda3\lib\site-packages (from pyppeteer->notebook-as-pdf) (2025.4.26)
Requirement already satisfied: importlib-metadata>=1.4 in c:\users\utkar\anaconda3\lib\site-packages (from pyppeteer->notebook-as-pdf) (7.0.1)
Collecting pyee<12.0.0,>=11.0.0 (from pyppeteer->notebook-as-pdf)
  Downloading pyee-11.1.1-py3-none-any.whl.metadata (2.8 kB)
Requirement already satisfied: tqdm<5.0.0,>=4.42.1 in c:\users\utkar\anaconda3\lib\site-packages (from pyppeteer->notebook-as-pdf) (4.66.5)
Collecting urllib3<2.0.0,>=1.25.8 (from pyppeteer->notebook-as-pdf)
  Downloading urllib3-1.26.20-py2.py3-none-any.whl.metadata (50 kB)
Collecting websockets<11.0,>=10.0 (from pyppeteer->notebook-as-pdf)
  Downloading websockets-10.4.tar.gz (84 kB)
  Preparing metadata (setup.py): started
  Preparing metadata (setup.py): finished with status 'done'
Requirement already satisfied: six>=1.9.0 in c:\users\utkar\anaconda3\lib\site-packages (from bleach!=5.0.0->nbconvert->notebook-as-pdf) (1.16.0)
Requirement already satisfied: webencodings in c:\users\utkar\anaconda3\lib\site-packages (from bleach!=5.0.0->nbconvert->notebook-as-pdf) (0.5.1)
Requirement already satisfied: zipp>=0.5 in c:\users\utkar\anaconda3\lib\site-packages (from importlib-metadata>=1.4->pyppeteer->notebook-as-pdf) (3.17.0)
Requirement already satisfied: platformdirs>=2.5 in c:\users\utkar\anaconda3\lib\site-packages (from jupyter-core>=4.7->nbconvert->notebook-as-pdf) (3.10.0)
Requirement already satisfied: pywin32>=300 in c:\users\utkar\anaconda3\lib\site-packages (from jupyter-core>=4.7->nbconvert->notebook-as-pdf) (305.1)
Requirement already satisfied: jupyter-client>=6.1.12 in c:\users\utkar\anaconda3\lib\site-packages (from nbclient>=0.5.0->nbconvert->notebook-as-pdf) (8.6.0)
Requirement already satisfied: fastjsonschema>=2.15 in c:\users\utkar\anaconda3\lib\site-packages (from nbformat>=5.7->nbconvert->notebook-as-pdf) (2.16.2)
Requirement already satisfied: jsonschema>=2.6 in c:\users\utkar\anaconda3\lib\site-packages (from nbformat>=5.7->nbconvert->notebook-as-pdf) (4.23.0)
Requirement already satisfied: typing-extensions in c:\users\utkar\anaconda3\lib\site-packages (from pyee<12.0.0,>=11.0.0->pyppeteer->notebook-as-pdf) (4.11.0)
Requirement already satisfied: colorama in c:\users\utkar\anaconda3\lib\site-packages (from tqdm<5.0.0,>=4.42.1->pyppeteer->notebook-as-pdf) (0.4.6)
Requirement already satisfied: soupsieve>1.2 in c:\users\utkar\anaconda3\lib\site-packages (from beautifulsoup4->nbconvert->notebook-as-pdf) (2.5)
Requirement already satisfied: attrs>=22.2.0 in c:\users\utkar\anaconda3\lib\site-packages (from jsonschema>=2.6->nbformat>=5.7->nbconvert->notebook-as-pdf) (23.1.0)
Requirement already satisfied: jsonschema-specifications>=2023.03.6 in c:\users\utkar\anaconda3\lib\site-packages (from jsonschema>=2.6->nbformat>=5.7->nbconvert->notebook-as-pdf) (2023.7.1)
Requirement already satisfied: referencing>=0.28.4 in c:\users\utkar\anaconda3\lib\site-packages (from jsonschema>=2.6->nbformat>=5.7->nbconvert->notebook-as-pdf) (0.30.2)
Requirement already satisfied: rpds-py>=0.7.1 in c:\users\utkar\anaconda3\lib\site-packages (from jsonschema>=2.6->nbformat>=5.7->nbconvert->notebook-as-pdf) (0.10.6)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\utkar\anaconda3\lib\site-packages (from jupyter-client>=6.1.12->nbclient>=0.5.0->nbconvert->notebook-as-pdf) (2.9.0.post0)
Requirement already satisfied: pyzmq>=23.0 in c:\users\utkar\anaconda3\lib\site-packages (from jupyter-client>=6.1.12->nbclient>=0.5.0->nbconvert->notebook-as-pdf) (25.1.2)
Requirement already satisfied: tornado>=6.2 in c:\users\utkar\anaconda3\lib\site-packages (from jupyter-client>=6.1.12->nbclient>=0.5.0->nbconvert->notebook-as-pdf) (6.4.1)
Downloading notebook_as_pdf-0.5.0-py3-none-any.whl (6.5 kB)
Downloading pypdf2-3.0.1-py3-none-any.whl (232 kB)
Downloading pyppeteer-2.0.0-py3-none-any.whl (82 kB)
Downloading pyee-11.1.1-py3-none-any.whl (15 kB)
Downloading urllib3-1.26.20-py2.py3-none-any.whl (144 kB)
Building wheels for collected packages: websockets
  Building wheel for websockets (setup.py): started
  Building wheel for websockets (setup.py): finished with status 'done'
  Created wheel for websockets: filename=websockets-10.4-cp312-cp312-win_amd64.whl size=95034 sha256=1c4f8f1aafeb1d5a079f6236ebd52850fc989f2990f56305244a08d1506298c9
  Stored in directory: c:\users\utkar\appdata\local\pip\cache\wheels\80\cf\6d\5d7e4c920cb41925a178b2d2621889c520d648bab487b1d7fd
Successfully built websockets
Installing collected packages: websockets, urllib3, PyPDF2, pyee, pyppeteer, notebook-as-pdf
  Attempting uninstall: urllib3
    Found existing installation: urllib3 2.2.3
    Uninstalling urllib3-2.2.3:
      Successfully uninstalled urllib3-2.2.3
Successfully installed PyPDF2-3.0.1 notebook-as-pdf-0.5.0 pyee-11.1.1 pyppeteer-2.0.0 urllib3-1.26.20 websockets-10.4

ERROR: pip's dependency resolver does not currently take into account all the packages that are installed. This behaviour is the source of the following dependency conflicts.
conda-repo-cli 1.0.114 requires urllib3>=2.2.2, but you have urllib3 1.26.20 which is incompatible.

In [61]:
pyppeteer-install

NameError: name 'pyppeteer' is not defined